web/static/wsdl/suomiFiRekisteritiedot.wsdl

<?xml version="1.0" encoding="UTF-8"?>
<wsdl:definitions xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:tns="http://docs.koski-xroad.fi/producer" xmlns:xrd="http://x-road.eu/xsd/xroad.xsd" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:id="http://x-road.eu/xsd/identifiers" name="suomiFiRekisteritiedot" targetNamespace="http://docs.koski-xroad.fi/producer">
  <wsdl:types>
    <xsd:schema elementFormDefault="qualified" targetNamespace="http://docs.koski-xroad.fi/producer">
      <xsd:import id="xrd" namespace="http://x-road.eu/xsd/xroad.xsd" schemaLocation="http://x-road.eu/xsd/xroad.xsd"/>
      <xsd:element name="suomiFiRekisteritiedot">
        <xsd:complexType>
          <xsd:sequence>
            <xsd:element name="hetu" type="xsd:string"/>
          </xsd:sequence>
        </xsd:complexType>
      </xsd:element>
      <xsd:element name="suomiFiRekisteritiedotResponse"/>
    </xsd:schema>
  </wsdl:types>
  <wsdl:message name="requestheader">
    <wsdl:part name="client" element="xrd:client"/>
    <wsdl:part name="service" element="xrd:service"/>
    <wsdl:part name="userId" element="xrd:userId"/>
    <wsdl:part name="id" element="xrd:id"/>
    <wsdl:part name="issue" element="xrd:issue"/>
    <wsdl:part name="protocolVersion" element="xrd:protocolVersion"/>
  </wsdl:message>
  <wsdl:message name="suomiFiRekisteritiedot">
    <wsdl:part name="body" element="tns:suomiFiRekisteritiedot"/>
  </wsdl:message>
  <wsdl:message name="suomiFiRekisteritiedotResponse">
    <wsdl:part name="body" element="tns:suomiFiRekisteritiedotResponse"/>
  </wsdl:message>
  <wsdl:portType name="suomiFiRekisteritiedotServicePortType">
    <wsdl:operation name="suomiFiRekisteritiedot">
      <wsdl:input message="tns:suomiFiRekisteritiedot"/>
      <wsdl:output message="tns:suomiFiRekisteritiedotResponse"/>
    </wsdl:operation>
  </wsdl:portType>
  <wsdl:binding name="suomiFiRekisteritiedotServiceBinding" type="tns:suomiFiRekisteritiedotServicePortType">
    <soap:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"/>
    <wsdl:operation name="suomiFiRekisteritiedot">
      <soap:operation soapAction="" style="document"/>
      <xrd:version>v1</xrd:version>
      <wsdl:input>
        <soap:body parts="body" use="literal"/>
        <soap:header message="tns:requestheader" part="client" use="literal"/>
        <soap:header message="tns:requestheader" part="service" use="literal"/>
        <soap:header message="tns:requestheader" part="userId" use="literal"/>
        <soap:header message="tns:requestheader" part="id" use="literal"/>
        <soap:header message="tns:requestheader" part="issue" use="literal"/>
        <soap:header message="tns:requestheader" part="protocolVersion" use="literal"/>
      </wsdl:input>
      <wsdl:output>
        <soap:body parts="body" use="literal"/>
        <soap:header message="tns:requestheader" part="client" use="literal"/>
        <soap:header message="tns:requestheader" part="service" use="literal"/>
        <soap:header message="tns:requestheader" part="userId" use="literal"/>
        <soap:header message="tns:requestheader" part="id" use="literal"/>
        <soap:header message="tns:requestheader" part="issue" use="literal"/>
        <soap:header message="tns:requestheader" part="protocolVersion" use="literal"/>
      </wsdl:output>
    </wsdl:operation>
  </wsdl:binding>
  <wsdl:service name="suomiFiRekisteritiedot">
    <wsdl:port binding="tns:suomiFiRekisteritiedotServiceBinding" name="suomiFiRekisteritiedotServicePort">
      <soap:address location="http://example.org/xroad-endpoint"/>
    </wsdl:port>
  </wsdl:service>
</wsdl:definitions>
